controllers/DaftarJurusanController.php

SELECT * FROM `daftar_jurusan`
---
    public function actionList(){
        $model = DaftarJurusan::find()
                ->asArray()
                ->all();