controllers/MapController.php

SELECT `daftar_smk`.* FROM `daftar_smk` LEFT JOIN `map` ON `daftar_smk`.`npsn` = `map`.`npsn` LEFT JOIN `detail_jurusan` ON `daftar_smk`.`npsn` = `detail_jurusan`.`npsn` WHERE `daftar_smk`.`akreditasi` IN ('A', 'X')
SELECT `daftar_smk`.* FROM `daftar_smk` LEFT JOIN `map` ON `daftar_smk`.`npsn` = `map`.`npsn` LEFT JOIN `detail_jurusan` ON `daftar_smk`.`npsn` = `detail_jurusan`.`npsn` WHERE (`daftar_smk`.`akreditasi` IN ('A', 'X')) AND (`detail_jurusan`.`kode_jurusan`='J003') GROUP BY `daftar_smk`.`npsn`
SELECT `daftar_smk`.* FROM `daftar_smk` LEFT JOIN `map` ON `daftar_smk`.`npsn` = `map`.`npsn` LEFT JOIN `detail_jurusan` ON `daftar_smk`.`npsn` = `detail_jurusan`.`npsn` WHERE `detail_jurusan`.`kode_jurusan`='J003' GROUP BY `daftar_smk`.`npsn`
SELECT `daftar_smk`.* FROM `daftar_smk` LEFT JOIN `map` ON `daftar_smk`.`npsn` = `map`.`npsn` LEFT JOIN `detail_jurusan` ON `daftar_smk`.`npsn` = `detail_jurusan`.`npsn`
---
    public function actionListmap(array $data1=null, array $data2 = null){
        $map = null;
       if ($data1 != null && $data2 == null){
            $map = DaftarSmk::find()
                ->joinWith('map')
                ->joinWith('detailJurusan')
                ->where(['daftar_smk.akreditasi' => $data1])
                ->asArray()
                ->all();
       }else if($data1 != null && $data2 != null){
            $map = DaftarSmk::find()
                ->joinWith('map')
                ->joinWith('detailJurusan')
                ->where(['daftar_smk.akreditasi' => $data1,'detail_jurusan.kode_jurusan' => $data2])
                ->groupBy('{{daftar_smk}}.npsn')
                ->asArray()
                ->all();
       }else if($data1 == null && $data2 != null){
            $map = DaftarSmk::find()
                ->joinWith('map')
                ->joinWith('detailJurusan')
                ->where(['detail_jurusan.kode_jurusan' => $data2])
                ->groupBy('{{daftar_smk}}.npsn')
                ->asArray()
                ->all();
       }else if($data1 == null && $data2 == null){
           $map = DaftarSmk::find()
                ->joinWith('map')
                ->joinWith('detailJurusan')
                ->asArray()
                ->all();