controllers/SiteController.php

SELECT COUNT(*) FROM `daftar_jurusan`
SELECT * FROM `daftar_jurusan` LIMIT 5 OFFSET 10
---
    public function actionIndex()
    {
        //$model = DaftarJurusan::find()->all();
        // build a DB query to get all articles with status = 1
        $query = DaftarJurusan::find();
        $count = $query->count();
        $pagination = new Pagination(['totalCount' => $count, 'pageSize'=>5]);

        $model = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();